{
	"IllegalCharacterInNumberException" = "Por favor verifique o valor <b>@@escapedValue@@</b> que você forneceu ao campo <b>@@displayNameForProperty@@</b>.";
	"InvalidDateFormatException" = "Por favor verifique que <b>@@displayNameForProperty@@</b> como <b>@@escapedValue@@</b> não é uma data válida";
	"InvalidNumberException" = "Este valor é não é válido.";
	"MandatoryToManyRelationshipException" = "Um(a) <b>@@displayNameForEntity@@</b> precisa ter ao menos um(a) <b>@@displayNameForDestinationEntity@@</b>.";
	"MandatoryToOneRelationshipException" = "Um(a) <b>@@displayNameForEntity@@</b> precisa ter um(a) <b>@@displayNameForProperty@@</b>.";
	"NotANumberException" = "Desculpe, não foi possível ler este número <b>@@escapedValue@@</b> ";
	"NullPropertyException" = "Por favor forneça @@indefiniteArticleForProperty@@ <b>@@displayNameForProperty@@</b>.";
	"ObjectCannotBeDeletedException" = "Não foi possível apagar <b>@@displayNameForEntity@@</b> porque esta(e) <b>@@displayNameForEntity@@</b> ou qualquer objeto relacionado a esta(e) <b>@@displayNameForEntity@@</b> não pode ser apagada(o).";
	"ObjectRemovalException" = "Não foi possível apagar <b>@@displayNameForEntity@@</b>. Você precisa primeiro apagar o item em seu(sua) <b>@@displayNameForProperty@@</b>.";
	"ObjectsRemovalException" = "Não foi possível apagar <b>@@displayNameForEntity@@</b>. Você precisa primeiro apagar o item em seu(sua) <b>@@displayNameForProperty@@</b>.";
	"PasswordsDontMatchException" = "A <b>passwords</b> que você digitou não confere";
	"PasswordsFillBothFieldsException" = "Por favor preencha <b>password</b> em ambos os campos";
	
	"QueryEmpty" = "Por favor forneça os critérios de busca";
	"QueryValueRequired" = "Por favor forneça um valor para @@displayNameForProperty@@";
	"QueryValueTooShort" = "O valor fornecido para @@displayNameForProperty@@ não é grande o suficiente";
	"QueryValueTooLong" = "O valor fornecido para @@displayNameForProperty@@ é muito grande";
	"QueryValueTooSmall" = "O valor fornecido para @@displayNameForProperty@@ é muito pequeno";
	"QueryValueTooLarge" = "O valor fornecido para @@displayNameForProperty@@ é muito grande";
}
